from selene.support.shared.jquery_style import s

# --------------------------------- Ссылка каталога под полем поиска -------------------------------------------- #
HEADER_CATALOG_LINK = s('[data-test-id=bottom-header-section-link]')
# ---------------------------------- Название товара в мини-карточке товара ------------------------------------- #
PRODUCT_ITEM_TITLE = s('[data-test-id=product-item-title] span')
# -------------------------------------- Картинка товара в мини-карточке товара --------------------------------- #
PRODUCT_IMAGE = s('.m-image__image[src]')
# ------------------------- Кнопка "Каталог", отображаемая рядом со строкой поиска ------------------------------ #
CATALOG_MENU_BUTTON = s('[data-test-id=catalog-btn]')
# -------------------- Заголовок категории в левой части страницы после нажатия кнопки "Каталог" ---------------- #
CATEGORY_TITLE = s('.//span[@data-test-id="left-catalog-item-title" '
                            'and not(contains(@class, "m-menu-item"))]')
# ----------------- Заголовок категории в левой части страницы по конкретному названию категории ---------------- #
CATEGORY_TITLE_WITH_PARAM = s('.//span[@data-test-id="left-catalog-item-title"][contains(text(),"{0}")]')
# --------------------- Название категории, которая сейчас открыта в главном окне ------------------------------- #
CATEGORY_TITLE_WHICH_OPEN_NOW = s('.//*[@data-test-id="category-title"]')
# ------------------------------------------- Кнопка сортировки по цене ----------------------------------------- #
SORT_BY_PRICE_BUTTON = s('.//button[@data-test-id="sort-price-btn"]')
# --------------------------------------------- Элемент товара -------------------------------------------------- #
PRODUCT = s('.//div[@data-test-id="product-item"]')
# --------------------------------------------- Наименование товара --------------------------------------------- #
PRODUCT_NAME = s('.//div[@data-test-id="product-item-title"]')
# ------------------------------------------------- Цена товара ------------------------------------------------- #
PRODUCT_PRICE = s('.//div[@data-test-id="product-item-price"]/span[1]')
# ---------------------------------------------- Старая цена товара --------------------------------------------- #
PRODUCT_OLD_PRICE = s('.//div[@data-test-id="product-item-price_old"]/span[1]')
# --------------------------------- Квант товара (минимальный шаг веса товара) ---------------------------------- #
PRODUCT_QUANT = s('.//div[@data-test-id="product-item-price"]/span[2]')
# ---------------------------------- Надпись у товара "Временно отсутствует" ------------------------------------ #
TEXT_PRODUCT_UNAVAILABLE = s('.//div[@class="product-card__info"]')
# ------------------------------------- Лоадер загрузки товаров (белый экран) ----------------------------------- #
PRODUCTS_LOADING_LOADER = s('.//div[@class="fade-enter-active fade-enter-to"]')
# -------------------------------- Активная кнопка сортировки по возрастанию цены ------------------------------- #
SORT_BY_ASCEND_PRICE_BUTTON = s('.//button[contains(@data-test-id,"sort-price-btn") and '
                                         'contains(@class,"decreasing")]')
# -------------------------------- Активная кнопка сортировки по убыванию цены ---------------------------------- #
SORT_BY_DESCEND_PRICE_BUTTON = s('.//button[contains(@data-test-id,"sort-price-btn") '
                                          'and contains(@class,"increasing")]')
# ---------------------------------------- Кнопка сортировки по алфавиту ---------------------------------------- #
SORT_BY_NAME_BUTTON = s('.//button[@data-test-id="sort-name-btn"]')
# ------------------------------------ Неактивная кнопка сортировки по алфавиту --------------------------------- #
SORT_BY_NAME_BUTTON_DISABLED = s('.//button[contains(@data-test-id,"sort-name-btn") '
                                          'and contains(@disable, "")]')
# -------------------------------------- Контент страницы каталога ---------------------------------------------- #
CATALOG_PAGE = s('.js-paginator-scrolling-catalog-layout')
# ------------------------------------------- Логотип в хэдере--------------------------------------------------- #
HEADER_LOGO = s('.//*[@data-test-id="header-logo-link"]')
# --------------------------------- Контент главной страницы сайта ---------------------------------------------- #
HOME_PAGE = s('.page-home')
# --------------------------------------- Адрес доставки -------------------------------------------------------- #
SELECT_ADDRESS_DELIVEERY = s('[class="select-address__address"]')

INPUT_ADDRESS_DELIVERY = s('[data-test-id="delivery-address-input"]')